import pandas as pd
import matplotlib.pyplot as plt

data = {
    'name' : ['Наташа', 'Александр', 'Николай', 'Сергей', 'Оля', 'Нина', 'Тимофей', 'Анатолий', 'Ирина', 'Елена'],
    'Mathematics' : [3, 5, 3, 4, 5, 3, 4, 3, 5, 4],
    'Geometry' : [3, 4, 4, 3, 5, 4, 5, 3, 4, 3],
    'Chemistr' : [4, 4, 3, 4, 5, 5, 4, 3, 3, 5],
    'History' : [4, 5, 5, 4, 3, 4, 4, 5, 5, 4],
    'Biology' : [3, 4, 5, 4, 3, 4, 3, 3, 4, 3]
    }

# Создание DataFrame
df = pd.DataFrame(data)

# Вычисление средних оценок по предметам (исключая нечисловые столбцы)
mean_scores = df.mean(numeric_only=True)

# Вычисление медианных оценок по предметам (исключая нечисловые столбцы)
median_scores = df.median(numeric_only=True)

# Вычисление квантилей для математики
Q1_math = df['Mathematics'].quantile(0.25)
Q3_math = df['Mathematics'].quantile(0.75)

# Вычисление стандартного отклонения по предметам (исключая нечисловые столбцы)
std_deviation = df.std(numeric_only=True)
df['Average'] = df.iloc[:, 1:].mean(axis=1)

# Вывод результатов
#print(df.head())
print(df)
print('_________________________________________________________________________')
print("\nСредние оценки каждого ученика по всем предметам:")
print('_________________________________________________________________________')
print(df[['name', 'Average']])
print('_________________________________________________________________________')
print("Средние оценки по предметам:\n", mean_scores)
print('_________________________________________________________________________')
print("Медианные оценки по предметам:\n", median_scores)
print('_________________________________________________________________________')
print("Квантили для оценок по математике:\nQ1 (25-й перцентиль):", Q1_math, "\nQ3 (75-й перцентиль):", Q3_math)
print('_________________________________________________________________________')
print("Стандартное отклонение по предметам:\n", std_deviation)
print('_________________________________________________________________________')

# Выведем на экран график средней успеваемости учеников по предметам и средней оценки успеваемости по предметам:
# Вычисление средних оценок по каждому предмету
subject_means = df.loc[:, 'Mathematics':'Biology'].mean()

# Вычисление средних оценок каждого ученика по всем предметам
df['Average'] = df.loc[:, 'Mathematics':'Biology'].mean(axis=1)

# Визуализация средних оценок по предметам
plt.figure(figsize=(20, 10))
plt.subplot(1, 2, 1)
subject_means.plot(kind='bar', color='skyblue')
plt.title('Средние оценки по предметам')
plt.ylabel('Средняя оценка')
plt.xlabel('Предмет')
plt.xticks(rotation=45)
plt.ylim(0, 5)

# Визуализация средних оценок каждого ученика
plt.subplot(1, 2, 2)
df.sort_values('Average', inplace=True)
plt.bar(df['name'], df['Average'], color='lightgreen')
plt.title('Средние оценки каждого ученика')
plt.ylabel('Средняя оценка')
plt.xlabel('Имя ученика')
plt.xticks(rotation=90)
plt.ylim(0, 5)

# Отображение графиков
plt.tight_layout()
plt.show()